imported packegs of this environemnt include:
  - python=3.10
  - jupyter=1.0.0
  - geopandas=0.12.2
  - folium=0.14.0
  - seaborn=0.12.2
  - sqlalchemy=1.4.39
  - psycopg2=2.9.3

exploratory analysis

- Are there any null values in any columns in either table?
- What date range is represented in each of the date columns? Investigate any values that seem odd.
- Is time represented with am/pm or using 24 hour values in each of the columns that include time?
- What values are there in the sumdgroup column? Are there any that are not of interest for this project?
- What are the minimum and maximum values for all the latitude and longitude columns? Do these ranges make sense, or is there anything surprising? 
- What is the range of values for trip duration and trip distance? Do these values make sense? Explore values that might seem questionable.
- Check out how the values for the company name column in the scooters table compare to those of the trips table. What do you notice?

# connecting database to engine

In [1]:
from sqlalchemy import create_engine, text

In [2]:
import pandas as pd

In [3]:
database_name = 'metro_scooters'

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [4]:
engine = create_engine(connection_string)

# code for sqlalchemy bolt

query = '''
SELECT *
FROM scooters
WHERE companyname = 'Bolt';
'''

with engine.connect() as connection:
    bolt_scooters = pd.read_sql(text(query), con = connection)
    
bolt_scooters.head()

# code for sqlalchemy bird

query = '''
SELECT *
FROM scooters
WHERE companyname = 'Bird';
'''

with engine.connect() as connection:
    bird_scooters = pd.read_sql(text(query), con = connection)
    
bird_scooters.head()

# code for sqlalchemy gotcha

query = '''
SELECT *
FROM scooters
WHERE companyname = 'Gotcha';
'''

with engine.connect() as connection:
    gotcha_scooters = pd.read_sql(text(query), con = connection)
    
gotcha_scooters.head()

# code for sqlalchemy lime 
query = '''
SELECT *
FROM scooters
WHERE companyname = 'Lime';
'''

with engine.connect() as connection:
    lime_scooters = pd.read_sql(text(query), con = connection)
    
lime_scooters.head()

# code for sqlalchemy jump
query = '''
SELECT *
FROM scooters
WHERE companyname = 'Jump';
'''

with engine.connect() as connection:
    jump_scooters = pd.read_sql(text(query), con = connection)
    
jump_scooters.head()

# code for sqlachemy spin

query = ''' SELECT * FROM scooters WHERE companyname = 'Spin'; '''

with engine.connect() as connection: spin_scooters = pd.read_sql(text(query), con = connection)

spin_scooters.head()

# code for sqlalchemy lyft

query = ''' SELECT * FROM scooters WHERE companyname = 'Lyft'; '''

with engine.connect() as connection: lyft_scooters = pd.read_sql(text(query), con = connection)

lyft_scooters.head()

# read in csv of bird scooters

In [5]:
bird_scooters = pd.read_csv('../data/birddf.csv')
bird_scooters.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 17:37:28.870,36.141562,-86.806655,PoweredVAW9Y,Powered,95.0,scooter,0.15,Bird
1,2019-07-30 17:37:28.870,36.159744,-86.780067,PoweredSNB79,Powered,58.0,scooter,0.15,Bird
2,2019-07-30 17:37:28.870,36.153569,-86.784961,PoweredZY5KX,Powered,100.0,scooter,0.15,Bird
3,2019-07-30 17:37:28.870,36.155984,-86.782756,PoweredPHVAG,Powered,100.0,scooter,0.15,Bird
4,2019-07-30 17:37:28.870,36.147253,-86.815000,Powered238ZE,Powered,76.0,scooter,0.15,Bird

# read in csv of bolt scooters

In [6]:
bolt_scooters = pd.read_csv('../data/boltdf.csv')
bolt_scooters.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 17:34:09,36.158986,-86.777469,Powered-a5530bc9-d4c0-7ad4-7e21-87bcca195865,Powered,65.71,Scooter,0.3,Bolt
1,2019-07-30 17:34:09,36.165869,-86.777765,Powered-751e19ec-b697-a51f-04ea-0bf9a2e125c9,Powered,69.41,Scooter,0.3,Bolt
2,2019-07-30 17:34:09,36.149978,-86.814553,Powered-f4909631-d138-c9ee-cbec-8efc5568b77d,Powered,67.99,Scooter,0.3,Bolt
3,2019-07-30 17:34:09,36.163135,-86.775989,Powered-601cf2bd-1750-3e32-c23a-aabc76b61d65,Powered,94.39,Scooter,0.3,Bolt
4,2019-07-30 17:34:09,36.150896,-86.804663,Powered-4aede0e0-a137-ca41-680e-c9c6b8a54fa9,Powered,99.49,Scooter,0.3,Bolt

# read in csv of gothca scooters

In [7]:
gotcha_scooters = pd.read_csv('../data/gotchadf.csv')
gotcha_scooters.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 22:53:32.163,33.792620,-84.402760,Powered2460,Powered,47.0,Scooter,0.15,Gotcha
1,2019-07-30 22:53:32.163,36.121395,-86.769998,Powered775,Powered,0.0,Scooter,0.15,Gotcha
2,2019-07-30 22:53:32.163,36.121441,-86.769995,Powered794,Powered,0.0,Scooter,0.15,Gotcha
3,2019-07-30 22:53:32.163,33.792609,-84.402744,Powered2503,Powered,27.0,Scooter,0.15,Gotcha
4,2019-07-30 22:53:32.163,36.121265,-86.770278,Powered1913,Powered,32.0,Scooter,0.15,Gotcha

# read in csv of jump scooters

In [8]:
jump_scooters = pd.read_csv('../data/jumpdf.csv')
jump_scooters.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 17:33:42,36.1195,-86.7534,Powered997dfabc-4fa3-557c-989c-33da0d096d6b,Powered,65.0,scooter,0.06,Jump
1,2019-07-30 17:33:42,36.1199,-86.7534,Poweredba213730-5704-5625-af7f-31c34d960b66,Powered,4.0,scooter,0.06,Jump
2,2019-07-30 17:33:42,36.1199,-86.7533,Poweredd6e29e2c-0f61-57ac-8237-5854332b595f,Powered,3.0,scooter,0.06,Jump
3,2019-07-30 17:33:42,36.1202,-86.7533,Powered7a0a9782-2e7b-5282-9d10-cbe0750c703e,Powered,0.0,scooter,0.06,Jump
4,2019-07-30 17:33:42,36.1199,-86.7534,Powered0d329ae3-b18b-5e2a-9f3f-c2d91679c324,Powered,3.0,scooter,0.06,Jump

# read in csv lime scooters

In [9]:
lime_scooters = pd.read_csv('../data/limedf.csv')
lime_scooters.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 17:35:18.710,36.182537,-86.793612,PoweredUD5AZXJ5UMT7B,Powered,75.0,scooter,0.15,Lime
1,2019-07-30 17:35:18.710,36.191159,-86.795243,PoweredEP7AKU3H6GPPG,Powered,38.0,scooter,0.15,Lime
2,2019-07-30 17:35:18.710,36.177788,-86.777875,PoweredSINZNV4OYDROU,Powered,47.0,scooter,0.15,Lime
3,2019-07-30 17:35:18.710,36.182087,-86.735612,Powered6PLOLGBTHDPWE,Powered,55.0,scooter,0.15,Lime
4,2019-07-30 17:35:18.710,36.177627,-86.777723,Powered5R3YEGGZITMVT,Powered,68.0,scooter,0.15,Lime

# read in csv lyft scooters

In [10]:
lyft_scooters = pd.read_csv('../data/lyftdf.csv')
lyft_scooters.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 17:34:49.530,36.135925,-86.767207,Powered788160,Powered,48.0,scooter,0.15,Lyft
1,2019-07-30 17:55:09.643,36.162249,-86.790378,Powered334889,Powered,86.0,scooter,0.15,Lyft
2,2019-07-30 17:34:49.677,36.143064,-86.802958,Powered266526,Powered,17.0,scooter,0.15,Lyft
3,2019-07-30 17:34:49.700,36.177629,-86.777725,Powered876748,Powered,66.0,scooter,0.15,Lyft
4,2019-07-30 17:55:09.663,36.145882,-86.816281,Powered037286,Powered,95.0,scooter,0.15,Lyft

# read in csv spin scooters

In [11]:
spin_scooters = pd.read_csv('../data/spindf.csv')
spin_scooters.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 17:35:06.990,36.14528,-86.80569,Powered7049691,Powered,92.0,Scooter,0.23,Spin
1,2019-07-30 17:35:06.990,36.16017,-86.77848,Powered8631385,Powered,91.0,Scooter,0.23,Spin
2,2019-07-30 17:35:06.990,36.15249,-86.79480,Powered1741740,Powered,91.0,Scooter,0.23,Spin
3,2019-07-30 17:35:06.990,36.15947,-86.78826,Powered3114843,Powered,78.0,Scooter,0.23,Spin
4,2019-07-30 17:35:06.990,36.16382,-86.77891,Powered8546104,Powered,85.0,Scooter,0.23,Spin

# read in csv of trips table

In [12]:
trips = pd.read_csv('../data/tripsdf.csv')
trips.head()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 00:00:55.423,Bird,BRD2134,Powered9EAJL,3.0000,958.00528,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.15710,-86.80360,36.15660,-86.80670,"[(36.157235, -86.803612), (36.157235, -86.8036...",2019-05-02 05:30:23.780
1,2019-05-01 00:03:33.147,Lyft,LFT5,Powered296631,1.7156,1371.39112,2019-05-01,00:01:50.090000,2019-05-01,00:03:33.026666,36.15797,-86.77896,36.16054,-86.77689,"[(36.15797, -86.77896), (36.15795, -86.77873),...",2019-05-02 07:20:32.757
2,2019-05-01 00:05:55.570,Bird,BRD2168,Powered7S2UU,3.0000,2296.58800,2019-05-01,00:03:47.363333,2019-05-01,00:07:13.596666,36.15470,-86.78180,36.15650,-86.78680,"[(36.155068, -86.782124), (36.156597, -86.78675)]",2019-05-02 05:30:24.530
3,2019-05-01 00:05:55.570,Bird,BRD2166,PoweredZIIVX,3.0000,1200.78744,2019-05-01,00:04:21.386666,2019-05-01,00:06:59.176666,36.14940,-86.77950,36.15310,-86.77960,"[(36.149741, -86.779344), (36.149741, -86.7793...",2019-05-02 05:30:24.237
4,2019-05-01 00:05:55.570,Bird,BRD2165,PoweredJ7MB3,2.0000,351.04988,2019-05-01,00:04:27.796666,2019-05-01,00:06:23.150000,36.17780,-86.78660,36.17740,-86.78760,"[(36.177699, -86.786477), (36.177711, -86.7864...",2019-05-02 05:30:24.207

# merge scooters back together

In [14]:
scooters_list = [bird_scooters, bolt_scooters, gotcha_scooters, jump_scooters, lime_scooters, lyft_scooters, spin_scooters]
scootersdf = pd.concat(scooters_list)

# exploratory analysis

In [20]:
scootersdf.info()

<class 'pandas.core.frame.DataFrame'>
Index: 73414043 entries, 0 to 5559572
Data columns (total 9 columns):
 #   Column       Dtype
---  ------       -----
 0   pubdatetime  object
 1   latitude     float64
 2   longitude    float64
 3   sumdid       object
 4   sumdtype     object
 5   chargelevel  float64
 6   sumdgroup    object
 7   costpermin   float64
 8   companyname  object
dtypes: float64(4), object(5)
memory usage: 6.0+ GB

In [21]:
trips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 565522 entries, 0 to 565521
Data columns (total 16 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   pubtimestamp    565522 non-null  object
 1   companyname     565522 non-null  object
 2   triprecordnum   565522 non-null  object
 3   sumdid          565522 non-null  object
 4   tripduration    565522 non-null  float64
 5   tripdistance    565522 non-null  float64
 6   startdate       565522 non-null  object
 7   starttime       565522 non-null  object
 8   enddate         565522 non-null  object
 9   endtime         565522 non-null  object
 10  startlatitude   565522 non-null  float64
 11  startlongitude  565522 non-null  float64
 12  endlatitude     565522 non-null  float64
 13  endlongitude    565522 non-null  float64
 14  triproute       565522 non-null  object
 15  create_dt       565522 non-null  object
dtypes: float64(6), object(10)
memory usage: 69.0+ MB

checking for nulls

In [15]:
scootersdf.isna().any()

pubdatetime    False
latitude       False
longitude      False
sumdid         False
sumdtype       False
chargelevel     True
sumdgroup      False
costpermin     False
companyname    False
dtype: bool

In [18]:
scootersdf.isna().sum().sum()

770

In [19]:
trips.isna().any()

pubtimestamp      False
companyname       False
triprecordnum     False
sumdid            False
tripduration      False
tripdistance      False
startdate         False
starttime         False
enddate           False
endtime           False
startlatitude     False
startlongitude    False
endlatitude       False
endlongitude      False
triproute         False
create_dt         False
dtype: bool

date range of the tables

In [31]:
#convert pubdatetime in scootersdf to data time instead of object
scootersdf['pubdatetime'] = pd.to_datetime(scootersdf['pubdatetime'], dayfirst=True, format = 'mixed')

In [32]:
scootersdf.info()

<class 'pandas.core.frame.DataFrame'>
Index: 73414043 entries, 0 to 5559572
Data columns (total 9 columns):
 #   Column       Dtype
---  ------       -----
 0   pubdatetime  datetime64[ns]
 1   latitude     float64
 2   longitude    float64
 3   sumdid       object
 4   sumdtype     object
 5   chargelevel  float64
 6   sumdgroup    object
 7   costpermin   float64
 8   companyname  object
dtypes: datetime64[ns](1), float64(4), object(4)
memory usage: 6.0+ GB

In [33]:
#convert pubtimestamp in trips to data time instead of object
trips['pubtimestamp'] = pd.to_datetime(trips['pubtimestamp'], dayfirst=True, format = 'mixed')

In [34]:
trips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 565522 entries, 0 to 565521
Data columns (total 16 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   pubtimestamp    565522 non-null  datetime64[ns]
 1   companyname     565522 non-null  object
 2   triprecordnum   565522 non-null  object
 3   sumdid          565522 non-null  object
 4   tripduration    565522 non-null  float64
 5   tripdistance    565522 non-null  float64
 6   startdate       565522 non-null  object
 7   starttime       565522 non-null  object
 8   enddate         565522 non-null  object
 9   endtime         565522 non-null  object
 10  startlatitude   565522 non-null  float64
 11  startlongitude  565522 non-null  float64
 12  endlatitude     565522 non-null  float64
 13  endlongitude    565522 non-null  float64
 14  triproute       565522 non-null  object
 15  create_dt       565522 non-null  object
dtypes: datetime64[ns](1), float64(6), object(9)
memory usage: 69.0+ MB

In [47]:
print(scootersdf['pubdatetime'].min())
print(scootersdf['pubdatetime'].max())

2019-05-01 00:01:41.247000
2019-07-31 23:59:57

In [48]:
print(trips['pubtimestamp'].min())
print(trips['pubtimestamp'].max())

2019-05-01 00:00:55.423000
2019-08-01 07:04:00

In [50]:
scootersdf.query('pubdatetime=="2019-07-31 23:59:57"')

C:\Users\Savannah\AppData\Local\Temp\ipykernel_25588\1706667872.py:1: FutureWarning: The behavior of 'isin' with dtype=datetime64[ns] and castable values (e.g. strings) is deprecated. In a future version, these will not be considered matching by isin. Explicitly cast to the appropriate dtype before calling isin instead.
  scootersdf.query('pubdatetime=="2019-07-31 23:59:57"')

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
44185,2019-07-31 23:59:57,36.165878,-86.777763,Powered-2cfdbb5b-85d4-47c1-8cbe-2859c2cceff9,Powered,64.30,Scooter,0.3,Bolt
44186,2019-07-31 23:59:57,36.161033,-86.777201,Powered-8506e49a-1f9d-fbed-5321-6f6dc0d44529,Powered,100.00,Scooter,0.3,Bolt
44187,2019-07-31 23:59:57,36.160000,-86.776610,Powered-51862bec-621e-8862-903d-8a79bd8566b4,Powered,90.41,Scooter,0.3,Bolt
44188,2019-07-31 23:59:57,36.164511,-86.776967,Powered-54e95d73-d46a-2c3d-2a66-17328b48a1fb,Powered,86.73,Scooter,0.3,Bolt
44189,2019-07-31 23:59:57,36.126582,-86.817020,Powered-ae41f71c-1dae-1278-9758-2accffd0bd43,Powered,90.26,Scooter,0.3,Bolt
...,...,...,...,...,...,...,...,...,...
45561,2019-07-31 23:59:57,36.162420,-86.779314,Powered-1a8321d0-5c21-04a4-bd7d-7b96ba51f17b,Powered,100.00,Scooter,0.3,Bolt
45562,2019-07-31 23:59:57,36.146010,-86.810197,Powered-bd4ba83b-513f-ed5c-3c51-b4f51e7fdc51,Powered,100.00,Scooter,0.3,Bolt
45563,2019-07-31 23:59:57,36.165837,-86.777765,Powered-cc9c0b7e-2b9e-def9-e48b-1a8a489c4daf,Powered,71.68,Scooter,0.3,Bolt
45564,2019-07-31 23:59:57,36.149792,-86.806818,Powered-55a7ac02-7e17-bb3b-130d-b160d9776405,Powered,0.00,Scooter,0.3,Bolt
45565,2019-07-31 23:59:57,36.162644,-86.779345,Powered-03be23ca-d43b-222f-be54-e44b5b4690df,Powered,100.00,Scooter,0.3,Bolt

In [51]:
trips.query('pubtimestamp=="2019-08-01 07:04:00"')

C:\Users\Savannah\AppData\Local\Temp\ipykernel_25588\622086476.py:1: FutureWarning: The behavior of 'isin' with dtype=datetime64[ns] and castable values (e.g. strings) is deprecated. In a future version, these will not be considered matching by isin. Explicitly cast to the appropriate dtype before calling isin instead.
  trips.query('pubtimestamp=="2019-08-01 07:04:00"')

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
565520,2019-08-01 07:04:00,JUMP,JMP35,Poweredf077a919-d569-5e70-8ca7-71d179ffacf9,142.34561,20433.6,2019-07-31,23:26:15,2019-08-01,01:48:35,36.155735,-86.775185,36.173904,-86.78545,"[('36.155736', '-86.775181'), ('36.155531', '-...",2019-08-02 08:24:21.967
565521,2019-08-01 07:04:00,JUMP,JMP34,Powered784fcc92-bd1a-5f6a-8314-b02aa21b4bfa,209.40965,14889.6,2019-07-31,22:19:08,2019-08-01,01:48:33,36.160050,-86.776720,36.163410,-86.78210,"[('36.160051', '-86.77672'), ('36.160051', '-8...",2019-08-02 08:24:22.000

note here, that the final time stamp for trips reflects a 7hr difference compared to that of the final timestamp for scooters

all time frames are represented with a 24hr clock

In [58]:
scootersdf.sumdgroup.unique()

array(['scooter', 'Scooter', 'bicycle'], dtype=object)

bicycle is not necessary for this analysis

min and max longitude, lattitude

In [63]:
print(scootersdf['latitude'].min())
print(scootersdf['latitude'].max())

0.0
3609874.116666

In [64]:
print(scootersdf['longitude'].min())
print(scootersdf['longitude'].max())

-97.443879
0.0

In [69]:
print(trips['startlatitude'].min())
print(trips['startlatitude'].max())

print(trips['endlatitude'].min())
print(trips['endlatitude'].max())

35.8532
36.300029
-36.850405
51.045409

In [71]:
print(trips['startlongitude'].min())
print(trips['endlongitude'].min())
print(trips['startlongitude'].max())
print(trips['endlongitude'].max())

-86.918008
-122.673729
-86.3662
174.764886

trip duration range

In [72]:
print(trips['tripduration'].min())
print(trips['tripduration'].max())

-19.3582666667
512619.0

trip distance range

In [73]:
print(trips['tripdistance'].min())
print(trips['tripdistance'].max())

-20324803.8
31884482.6476

In [75]:
trips.query('`tripdistance`==31884482.6476')

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
447799,2019-07-05 01:18:52,Gotcha,GOT9,Powered2460,9.0,3.188448e+07,2019-07-05,01:18:56,2019-07-05,01:27:56,36.16338,-86.780142,36.16628,-86.778127,"[('0', '0'), ('36.16628', '-86.77813')]",2019-07-06 07:13:12.210

In [76]:
trips.query('`tripdistance`==-20324803.8')

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
550038,2019-07-27 23:56:41.940,Bird,BRD5324,PoweredYZL2A,44.0,-20324803.8,2019-07-27,23:14:23.683333,2019-07-27,23:58:23.820000,36.1585,-86.7683,36.126,-86.7892,"[(36.158517, -86.768224), (36.158624, -86.7682...",2019-07-28 05:32:05.610

the values for trip distance to not allign for their values. The max trip distance reflects over 6000 miles, with a trip duration of 9 minutes which is impossible. Additionally, a negative value for distance is equally as improbable, even further with a trip duration of 44 minutes

exploring company name

In [78]:
scootersdf.companyname.unique()

array(['Bird', 'Bolt', 'Gotcha', 'Jump', 'Lime', 'Lyft', 'Spin'],
      dtype=object)

In [79]:
trips.companyname.unique()

array(['Bird', 'Lyft', 'Lime', 'Bolt Mobility', 'SPIN', 'Gotcha', 'JUMP'],
      dtype=object)

Jump and Spin are in all caps in the trips table, where as they are only capitalized in scooters. Additionaly, Bolt is called Bolt Mobility in the trips table and only Bolt in the scooters table

# Q1 During this period, seven companies offered scooters. How many scooters did each company have in this time frame?

In [87]:
#query using SQL alchemy
query = ''' 
SELECT 
    companyname AS company,
    COUNT(DISTINCT sumdid) AS units
FROM
    scooters
WHERE
    sumdgroup ILIKE 'scooter'
GROUP BY
    companyname; 
'''

with engine.connect() as connection: 
    company_scooters = pd.read_sql(text(query), con = connection)

company_scooters

  company  units
0    Bird   3860
1    Bolt    360
2  Gotcha    224
3    Jump   1210
4    Lime   1818
5    Lyft   1735
6    Spin    805

In [89]:
#query using python
company_scooters_py = scootersdf[['companyname', 'sumdid']].groupby(['companyname'])['sumdid']\
                                                        .nunique()\
                                                        .reset_index(name = 'count')\
                                                        .sort_values(['count'])
company_scooters_py

  companyname  count
2      Gotcha    224
1        Bolt    360
6        Spin    805
3        Jump   1210
5        Lyft   1735
4        Lime   1824
0        Bird   3860

In [90]:
(scootersdf
 .groupby(pd.Grouper(key = 'pubdatetime',     # point it to your datetime column
                     freq = '1M',               # How much do you want to group together values?
                     origin = 'epoch'           # This will start times at midnight of 1970-01-01. This ensure
                                                # This ensures that we are starting our first grouped period on the hour
                    ))
 ['sumdid']
 .count()
 .reset_index()
)

C:\Users\Savannah\AppData\Local\Temp\ipykernel_25588\3756639.py:2: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  .groupby(pd.Grouper(key = 'pubdatetime',     # point it to your datetime column

  pubdatetime    sumdid
0  2019-05-31  20292503
1  2019-06-30  28046095
2  2019-07-31  25075445